app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"

  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "Imana"], ["created_at", "2019-08-27 12:59:07.394799"], ["updated_at", "2019-08-27 12:59:07.394799"]]

  def update
    respond_to do |format|
      if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "content" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["content", "Ndikumana"], ["updated_at", "2019-08-27 12:58:39.480552"], ["id", 3]]

  def destroy
    @tweet.destroy
---
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 4]]

    def set_tweet
      @tweet = Tweet.find(params[:id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]